nc: 80  # number of classes
scales: 
  l: [1.00, 1.00, 1024]

backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]]  # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]]  # 1-P2/4
  - [-1, 1, CSEIB, [128]]  
  - [-1, 1, Conv, [256, 3, 2]]  # 3-P3/8
  - [-1, 1, CSEIB, [256]]
  - [-1, 1, Conv, [384, 3, 2]]  # 5-P4/16
  - [-1, 1, CSEIB, [384]]
  - [-1, 1, Conv, [384, 3, 2]]  # 7-P5/32
  - [-1, 3, CSEIB, [384]]

head:
  - [-1, 1, Conv, [256, 1, 1, None, 1, 1, False]]  # 9 input_proj.2
  - [-1, 1, TransformerEncoderLayer_PFET, [1024, 8]] # 10
  - [-1, 1, Conv, [256, 1, 1]]  # 11, Y5, lateral_convs.0

  - [[4, 6, 11], 1, SGMLFN, []] # 12
  - [12, 1, GetIndexOutput, [0]] # 13-P3/8
  - [12, 1, GetIndexOutput, [1]] # 14-P4/16
  - [12, 1, GetIndexOutput, [2]] # 15-P5/32

  - [11, 1, ECB, []] # 16-P5/32
  - [[-1, 15], 1, MSCF, []] # 17-P5/32

  - [6, 1, ECB, []] # 18-P4/16
  - [[-1, 17], 1, DAIF, []] # 19-P4/16
  - [[-1, 14], 1, MSCF, []] # 20-P4/16

  - [4, 1, ECB, []] # 21-P3/8
  - [[-1, 20], 1, DAIF, []] # 22-P3/8
  - [[-1, 13], 1, MSCF, []] # 23-P3/8

  - [-1, 1, Conv, [256, 3, 2]] # 24-P4/16
  - [[-1, 20], 1, Concat, [1]] # 25-P4/16
  - [-1, 3, RepC3, [256, 0.5]] # 26-P4/16

  - [-1, 1, Conv, [256, 3, 2]] # 27-P5/32
  - [[-1, 17], 1, Concat, [1]] # 28-P5/32
  - [-1, 3, RepC3, [256, 0.5]] # 29-P5/32

  - [[23, 26, 29], 1, RTDETRDecoder, [nc, 256, 300, 4, 8, 3]]  # Detect(P3, P4, P5)